Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromScaledLink
Can't acquire coordinates from a link that is scaled.

Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromLinkWithScaledLocation
Can't acquire coordiantes from a link that has a scaled location.

Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures
Failures about shared coordinates.